openfoam3/case_parallel_test/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
numberOfSubdomains 64;
method hierarchical;
simpleCoeffs { n (8 8 1); delta 0.001; }
hierarchicalCoeffs { n (8 8 1); delta 0.001; order xyz; }
